package powerJava;

public class GenericAndCollection2 {

}


/*
 * 
 * 5. 컬렉션
 * 
 * 컬렉션은 자바에서 자료구조를 구현한 클래스들을 칭하는 용어이다. 자료구조(data structure)는 자료를
 * 저장하기 위한 구조이다. 대부분의 프로그램은 자료를 저장하여야 하고 따라서 어떤 자료 구조를 사용할 것인지를
 * 결정하여야 한다. 예를 들어서 전화 번호부 프로그램은 전화 번호를 저장하여야 하고 메일 프로그램은 수신된
 * 메일을 어딘가에 저장하여야 한다. 많이 사용되는 자료 구조로는 list, stack, queue, set, hash table 등이 있다.
 * 
 * 왜 이렇게 다양한 자료 구조들이 제공되는 것일까? 자료구조는 자료를 저장하는 기능만 중요한 것이 아니고 빠르게
 * 검색하거나 정렬할 수 있는 기능도 중요하기 때문이다. 따라서 자신이 구현하고 있는 응용 분야에 맞는 최선의 자료구조를
 * 선택하여야 한다.
 * 
 * 컬렉션의 예: Vector 클래스
 * :
 * 컬렉션에 대하여 본격적으로 하
 * 
 * 
 * 
 * 
 * 
 * 
 */